app/controllers/shows_controller.rb

  def create
    @show = Show.new(show_params)

    respond_to do |format|
      if @show.save
---
INSERT INTO "shows" ("name", "venue", "description", "capacity", "price", "image", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def book
    # On crée un nouvel objet booking à partir des paramètres reçus
    @booking = Booking.new(booking_params)
    # On précise que cet object Booking dépend du show concerné
    @booking.show = @show

    respond_to do |format|
      if @booking.save
---
INSERT INTO "bookings" ("user_name", "seats", "show_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "Jean Pierre le Spectateur"], ["seats", 3], ["show_id", 1], ["created_at", 2016-10-05 10:09:57 UTC], ["updated_at", 2016-10-05 10:09:57 UTC]]

    def set_show
      @show = Show.find(params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]